Revit 2027 API
ReferenceArray.Size Property
Returns the number of references that are in the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Size { get; }
Public Overridable ReadOnly Property Size As Integer
	Get
public:
virtual property int Size {
	int get ();
}
abstract Size : int with get
override Size : int with get
Property Value
Int32
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace